/* Title for generic close button. */
"Generic.Close" = "Stäng";

/* Description for when provider list is empty. */
"ProviderList.EmptyList" = "Inga banker hittades";

/* Message for action sheet presented when user tries to dismiss modal while adding credentials. */
"Credentials.Discard.Message" = "Det är fullständigt säkert att ansluta till din bank och tar bara en minut.";

/* Subtitle for screen shown when credentials were added successfully. */
"ConnectionSuccess.Create.Subtitle" = "Anslutning till %@ har upprättats.";

/* Title for screen shown when credentials were added successfully. */
"ConnectionSuccess.Create.Title" = "Anslutningen lyckades";

/* Subtitle for screen shown when credentials were added successfully. */
"ConnectionSuccess.Update.Subtitle" = "Din anslutning till %@ har uppdaterats.";

/* Title for screen shown when credentials were added successfully. */
"ConnectionSuccess.Update.Title" = "Uppdateringen lyckades";

/* Description shown in the concent information screen. */
"ConsentInformation.Description" = "Genom att använda denna tjänst samlar vi in finansuppgifter om dig. Vi samlar in följande datapunkter:";

/* Title shown in the concent information screen. */
"ConsentInformation.Title" = "Vi samlar in följande uppgifter om dig";

/* Description text for add credentials screen. */
"Credentials.Description" = "Logga in på %@ för att fortsätta";


/* Text explaining that the client will obtain financial information from the current user with a link for more information on which financial information specifically. */
"Credentials.ConsentText" = "%@ kommer att få dina ekonomiska uppgifter. Läs mer";
/* Title for action to continue adding credentials. */
"Credentials.Discard.ContinueAction" = "Nej, fortsätt";

/* Title for action to discard adding credentials. */
"Credentials.Discard.PrimaryAction" = "Ja, avbryt";

/* Title for action sheet presented when user tries to dismiss modal while adding credentials. */
"Credentials.Discard.Title" = "Är det säkert att du vill avbryta?";

/* Title for error shown when authentication failed while adding credentials. */
"Credentials.Error.AuthenticationFailed" = "Autentiseringen misslyckades";

/* Message for error shown when credentials already exists. */
"Credentials.Error.CredentialsAlreadyExists" = "Du har redan en anslutning till den här banken eller tjänsten.";

/* Default title for error shown when download authentication app is required while adding credentials. */
"Credentials.Error.DownloadRequired" = "App för autentisering saknas";

/* Title for error shown when a permanent failure occured while adding credentials. */
"Credentials.Error.PermanentFailure" = "Permanent fel";

/* Title for error shown when a temporary failure occured while adding credentials. */
"Credentials.Error.TemporaryFailure" = "Tillfälligt fel";

/* Instruction texts for credentials that need to redirect */
"Credentials.Instructions" = "1. Du kommer på ett säkert sätt att överföras till %@.\n2. Du måste autentisera dig.\n3. När autentiseringen är klar dirigeras du tillbaka.";

/* Text for BankID button shown in the add credentials/authenticate screen. */
"Credentials.OpenBankID" = "Öppna BankID";

/* Privacy policy clickable text used in Credentials.TermsAndConsentText. */
"Credentials.PrivacyPolicy" = "integritetspolicy";


/* Read more text (clickable) to lead to consent information. */
"Credentials.ReadMore" = "Läs mer";
/* Terms and conditions clickable text used in Credentials.TermsAndConsentText. */
"Credentials.TermsAndConditions" = "användarvillkor";

/* Text explaining that when using the service, the user agrees to Tink's Terms and Conditions, Privacy Policy. And the text explaining that the client will obtain financial information from the current user with a link for more information on which financial information specifically. */
"Credentials.TermsAndConsentText" = "Genom att använda tjänsten godkänner du Tinks %1$@ och %2$@. %3$@ får delar av dina finansiella uppgifter. %4$@";


/* Text explaining that when using the service, the user agrees to Tink's Terms and Conditions and Privacy Policy. */
"Credentials.TermsText" = "Genom att använda tjänsten godkänner du Tinks användarvillkor och integritetspolicy";
/* Title for add credentials/authenticate screen. */
"Credentials.Title" = "Autentisera";


/* Subtitle for screen shown when credentials were added successfully. */
"ConnectionSuccess.Subtitle" = "Du har anslutit till %@.";

/* Title for screen shown when credentials were added successfully. */
"ConnectionSuccess.Title" = "Anslutningen lyckades";
/* Text for the warning shown when the developer is unverified. */
"Credentials.UnverifiedClient" = "Overifierad - Den här lösningen är endast gjord i utvecklingssyfte. Ange inte dina inloggningsuppgifter om du inte litar på utvecklaren.";

/* View details text (clickable) to lead to consent information that used in Credentials.TermsAndConsentText. */
"Credentials.ViewDetails" = "Visa detaljer";

/* Text shown for progress indicator dialog when in loading state. */
"CredentialsStatus.Authorizing" = "Autentiserar…";

/* Text shown for dialog when supplemental information is cancelled and waiting for credential status update. */
"CredentialsStatus.Cancelling" = "Avbryter…";

/* Text shown for dialog when supplemental information is submitted and waiting for credential status update. */
"CredentialsStatus.Sending" = "Skickar…";

/* Text shown for progress indicator dialog when status is CredentialStatus.Updating. */
"CredentialsStatus.Updating" = "Ansluter till %@. Vänligen vänta…";

/* Fallback text shown when fail to get bank name while updating credentials. */
"CredentialsStatus.UpdatingFallback" = "Ansluter. Vänligen vänta…";

/* Text shown when adding credentials and waiting for authentication on another device. */
"CredentialsStatus.WaitingForAuthenticationOnAnotherDevice" = "Väntar på autentisering på en annan enhet";

/* Text for field validation error shown when text entered exceeds character limit. */
"Field.Validation.MaxLengthLimit" = "Detta fält kan inte vara längre än %d tecken.";

/* Text for field validation error shown when text entered is shorter than required. */
"Field.Validation.MinLengthLimit" = "Fältet måste vara minst %d tecken.";

/* Text for field validation error shown when no text is entered for a required field. */
"Field.Validation.RequiredFieldEmptyValue" = "Detta fält kan inte vara tomt.";

/* Text used to form a list. */
"Generic.And" = "och";

/* Text shown for Cancel button. */
"Generic.Cancel" = "Avbryt";

/* Title for cancelled request. */
"Generic.Cancelled" = "Åtgärden avbröts";

/* Title for generic button to continue an action. */
"Generic.Continue" = "Fortsätt";

/* Title for action to dismiss error alert. */
"Generic.Dismiss" = "Stäng";

/* Title for action to confirm an event. */
"Generic.Done" = "Klar";

/* Title generic alert. */
"Generic.Error" = "Ett fel inträffade. Försök igen senare.";

/* Title for generic text to login. */
"Generic.Login" = "Logga in";

/* Title for action to confirm alert. */
"Generic.OK" = "OK";

/* Title for action to retry a failed request. */
"Generic.Retry" = "Försök igen";

/* Title for error alert if error doesn't contain a description. */
"Generic.ServiceAlert.FallbackTitle" = "Tjänsten är inte tillgänglig just nu.";

/* Description of the provider capability Checking Accounts. */
"ProviderCapability.CheckingAccounts" = "Personkonton";

/* Description of the provider capability Credit Cards. */
"ProviderCapability.CreditCards" = "Kreditkort";

/* Description of the provider capability E-Invoices. */
"ProviderCapability.EInvoices" = "E-fakturor";

/* Description of the provider capability Identity Data. */
"ProviderCapability.IdentityData" = "Identitetsuppgifter";

/* Description of the provider capability Investments. */
"ProviderCapability.Investments" = "Investeringar";

/* Description of the provider capability Loans. */
"ProviderCapability.Loans" = "Lån";

/* Description of the provider capability Mortgage Aggregation. */
"ProviderCapability.MortgageAggregation" = "Inteckningskonton";

/* Description of the provider capability Mortgage Loan. */
"ProviderCapability.MortgageLoan" = "Inteckningslån";

/* Description of the provider capability Payments. */
"ProviderCapability.Payments" = "Betalningar";

/* Description of the provider capability Savings Accounts. */
"ProviderCapability.SavingsAccounts" = "Sparkonton";

/* Description of the provider capability Transfers. */
"ProviderCapability.Transfers" = "Överföringar";

/* Description for error when providers could not be loaded. */
"ProviderList.Error.Description" = "Det kan vara ett tillfälligt fel. Försök igen och se om problemet kvarstår.";

/* Description for error when providers could not be loaded and it is likely it's a temporary error. */
"ProviderList.Error.Temporary" = "Det här kan vara ett tillfälligt fel, försök igen senare.";

/* Title for when providers could not be loaded. */
"ProviderList.Error.Title" = "Vi kan tyvärr inte visa några banker just nu";

/* Placeholder in search field shown in provider list. */
"ProviderList.SearchHint" = "Sök efter bank eller kort";

/* Title for list of all providers. */
"ProviderList.Title" = "Välj din bank";

/* Information text shown in the choose access type screen. */
"SelectAccessType.Information" = "På grund av EU-bestämmelser måste olika kontotyper anslutas separat.";

/* Title for the other account type (not an open banking account type) on the choose access type screen. */
"SelectAccessType.OtherType" = "Annat";

/* Title of the choose access type screen. */
"SelectAccessType.Title" = "Anslutningstyp";

/* Title for the business authentication user type */
"SelectAuthenticationUserType.Business" = "Logga in som företagskund";

/* Title for the corporate authentication user type */
"SelectAuthenticationUserType.Corporate" = "Företag";

/* Title for the personal authentication user type */
"SelectAuthenticationUserType.Personal" = "Logga in som privatkund";

/* Title when picking authentication user type. */
"SelectAuthenticationUserType.Title" = "Inloggningstyp";

/* Title for choose credential type screen. */
"SelectCredentialsType.Title" = "Inloggningsmetod";

/* Description shown for QR code in the supplemental information dialog. */
"SupplementalInformation.QRCodeDescription" = "Öppna BankID-appen och läs av denna QR-kod för att autentisera dig.";

/* Error shown when QR code cannot be fetched/generated/displayed. */
"SupplementalInformation.QRCodeError" = "Det gick inte att läsa QR-koden. Försök igen senare.";

/* Title shown for QR code in the supplemental information dialog. */
"SupplementalInformation.QRCodeTitle" = "Öppna BankID-appen";

/* Title for button to submit supplemental information. */
"SupplementalInformation.Submit" = "Skicka";

/* Title of the supplemental information dialog. */
"SupplementalInformation.Title" = "Tilläggsinformation";

/* Title for action to download app for third-party app authentication. */
"ThirdPartyAppAuthentication.DownloadAlert.Download" = "Ladda ner";

